---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GenericMEPFailures.ValidatePHSegmentConnWarning
source: html/e9f77cc8-e22c-9385-4034-f1f090235127.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GenericMEPFailures.ValidatePHSegmentConnWarning Property

The placeholder curve will not be able to connect to the required fittings for placeholder convert

## Syntax (C#)
```csharp
public static FailureDefinitionId ValidatePHSegmentConnWarning { get; }
```